tap "heroku/brew"
tap "homebrew/bundle"

brew "antidote"
brew "readline"
brew "asdf"
brew "chezmoi"
brew "direnv"
brew "fzf"
brew "git"
brew "gnupg"
brew "htop"
brew "sqlite"
brew "httpie"
brew "hub"
brew "jq"
brew "lua"
brew "neofetch"
brew "neovim"
brew "pandoc"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "heroku/brew/heroku"

cask "font-anonymous-pro"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-input"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-overpass"
cask "font-overpass-nerd-font"
cask "font-source-code-pro"
cask "font-terminus"
cask "hammerspoon"
cask "karabiner-elements"
cask "kitty"
cask "slack"
cask "visual-studio-code"
