tap 'homebrew/cask-cask'

cask 'alacritty'
cask 'alfred'
cask 'dash'
cask 'dropbox'
cask 'emacs'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'nvalt'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'visual-studio-code'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono'
cask 'font-anonymous-pro'
cask 'font-dejavu-sans'
cask 'font-hack'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-inconsolata'
cask 'font-inconsolata-dz'
cask 'font-input'
cask 'font-source-code-pro'
cask 'font-terminus'
cask 'font-overpass'

brew 'ack'
brew 'ansible'
brew 'aspell'
brew 'ctags'
brew 'direnv'
brew 'emacs'
brew 'exa'
brew 'fasd'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'gnu-sed'
brew 'gpg'
brew 'htop-osx'
brew 'httpie'
brew 'hub'
brew 'hunspell'
brew 'imagemagick'
brew 'ispell'
brew 'jq'
brew 'lua'
brew 'm-cli' # https://github.com/rgcr/m-cli
brew 'mas'
brew 'memcached'
brew 'neofetch'
brew 'pandoc'
brew 'python'
brew 'python3'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rg'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['--with-cscope', '--with-python', '--with-lua', '--override-system-vim']
brew 'watchman'
brew 'wget'
brew 'yarn' #, args: ['--without-node']
brew 'youtube-dl'
brew 'zsh'

brew 'getantibody/tap/antibody'

tap 'homebrew/versions'

tap 'neovim/neovim'
brew 'neovim', args: ['--with-cscope', '--with-python', '--with-lua', '--override-system-vim']

# Postgesql Multiple Versions
# https://github.com/petere/homebrew-postgresql
tap 'petere/postgresql'
brew 'postgresql-common'
brew 'posgresql-9.6'

# Heroku
# https://devcenter.heroku.com/articles/heroku-cli
tap 'heroku/brew'
brew 'heroku'

# App Store Stuff

mas 'Monosnap', id: 540348655
mas 'Sip', id: 507257563
mas 'FilePane', id: 847515307
mas 'Soulver', id: 413965349
# mas 'Realm Browser', id: 1007457278
# mas 'PopClip', id: 445189367

# maybe app store (tbd)
# mas 'Textual 5', id: 896450579
# mas 'ChronoMate, id: 472416858
# mas 'Paprika Recipe Manager', id: 451907568
# mas 'Alternote', id: 974971992
# mas 'Xcode', id: 497799835
# mas 'Shush', id: 496437906
# mas 'Blogo', id: 902111700
# mas 'Microsoft Remote Desktop', id: 715768417
# mas 'ForkLift', id: 412448059
# mas 'ReadKit', id: 588726889
# mas 'Keka', id: 470158793
# mas 'Evernote', id: 406056744
