tap 'caskroom/cask'
cask 'alfred'
cask 'atom'
cask 'dash'
cask 'dropbox'
cask 'emacs'
cask 'google-chrome'
cask 'hammerspoon'
cask 'hazel'
cask 'iterm2'
cask 'karabiner'
cask 'keepingyouawake'
cask 'nvalt'
cask 'screenhero'
cask 'skype'
cask 'skitch'
cask 'slack'
cask 'sourcetree'

tap 'caskroom/fonts'
cask 'font-dejavu-sans'
cask 'font-droid-sans-mono'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-source-code-pro'
cask 'font-terminus'
cask 'font-menlo-for-powerline'

brew 'ack'
brew 'ansible'
brew 'ctags'
brew 'direnv'
brew 'emacs'
brew 'fzf'
brew 'git'
brew 'gnu-sed'
brew 'htop-osx'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'macvim'
brew 'mas'
brew 'memcached'
brew 'myrepos'
brew 'node'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby-build'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['--with-cscope', '--with-python', '--with-lua', '--override-system-vim']
brew 'watchman'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

tap 'homebrew/versions'

tap 'neovim/neovim'
brew 'neovim/neovim/neovim', args: ['--with-cscope', '--with-python', '--with-lua', '--override-system-vim']

# App Store Stuff

mas 'Monosnap', id: 540348655
mas 'Sip', id: 507257563
mas 'FilePane', id: 847515307
mas 'Soulver', id: 413965349
mas 'Realm Browser', id: 1007457278
mas 'PopClip', id: 445189367

# maybe app store (tbd)
# mas 'Textual 5', id: 896450579
# mas 'ChronoMate, id: 472416858
# mas 'Paprika Recipe Manager', id: 451907568
# mas 'Alternote', id: 974971992
# mas 'Xcode', id: 497799835
# mas 'Shush', id: 496437906
# mas 'Blogo', id: 902111700
# mas 'Microsoft Remote Desktop', id: 715768417
# mas 'ForkLift', id: 412448059
# mas 'ReadKit', id: 588726889
# mas 'Keka', id: 470158793
# mas 'Evernote', id: 406056744
